tutorials/single_phase_elastic/cutOutPillars/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1914;
        startFace       52773;
    }
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       54687;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       54777;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          26910;
        startFace       54867;
    }
    emptyFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          26910;
        startFace       81777;
    }
)

// ************************************************************************* //
