tutorials/single_phase_elastic/cutOutPillars/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cylinderCells;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000095 0.000085 0.000000);
            p2      (0.000095 0.000085 1.000000);
            radius  0.000025;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000045 0.000105 0.000000);
            p2      (0.000045 0.000105 1.000000);
            radius  0.000015;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000115 0.000125 0.000000);
            p2      (0.000115 0.000125 1.000000);
            radius  0.000015;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000160 0.000120 0.000000);
            p2      (0.000160 0.000120 1.000000);
            radius  0.000020;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000150 0.000070 0.000000);
            p2      (0.000150 0.000070 1.000000);
            radius  0.000020;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000050 0.000060 0.000000);
            p2      (0.000050 0.000060 1.000000);
            radius  0.000020;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000030 0.000010 0.000000);
            p2      (0.000030 0.000010 1.000000);
            radius  0.000020;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000085 -0.000005 0.000000);
            p2      (0.000085 -0.000005 1.000000);
            radius  0.000025;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000115 0.000035 0.000000);
            p2      (0.000115 0.000035 1.000000);
            radius  0.000015;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000155 -0.000005 0.000000);
            p2      (0.000155 -0.000005 1.000000);
            radius  0.000025;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000220 0.000000 0.000000);
            p2      (0.000220 0.000000 1.000000);
            radius  0.000020;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000185 0.000035 0.000000);
            p2      (0.000185 0.000035 1.000000);
            radius  0.000015;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000195 0.000075 0.000000);
            p2      (0.000195 0.000075 1.000000);
            radius  0.000015;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000235 0.000115 0.000000);
            p2      (0.000235 0.000115 1.000000);
            radius  0.000025;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000235 0.000055 0.000000);
            p2      (0.000235 0.000055 1.000000);
            radius  0.000025;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
